README.org
# -*- mode: org; -*-

#+STARTUP: indent

* What

This project comprises instructions for setting up heterogeneous data
sources with Hasura v2.

* Why

There can never be too many tutorials, walk-throughs, and lighted
pathways for setting up Hasura.  This is yet another one.

* How

This project uses Docker Compose to launch services for PostgreSQL,
for MongoDB, for Redis, for Hasura, and for a Hasura Data Connector.
It also relies on a handful of environment variables to be supplied by
the user.  As a tutorial, it is divided into two parts:  Part A and
Part B.

Part A offers a sequence of steps to be performed at the Command Line
and optionally in a text editor, to create a Docker Compose file and
to acquire supporting initialization files to create the services.

Part B offers a sequence of steps to be performed in Hasura Console
once all the services have been launched.

* Part A:  At the Command Line

** Step 1:  Create a new directory.

Create a directory to work in and move to it.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  rm -rf scratch
  mkdir -p scratch
  cd scratch
#+end_src

- What did this do? ::
  This step just creates a scratch workspace for the project.

** Step 2:  Create a PostgreSQL initialization directory.

Create a directory to mount into the PostgreSQL container in order to
initialize the database.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  mkdir -p initdb.d-postgres
#+end_src

- What did this do? ::
  This step creates a directory that will be mounted into the
  PostgreSQL container as a volume, in a special directory that the
  container image uses to access initialization files.

** Step 3:  Download the PostgreSQL initialization files.

Download PostgreSQL initialization scripts into its initialization
directory.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  wget -O initdb.d-postgres/03_chinook_database.sql https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-postgres/03_chinook_database.sql
  wget -O initdb.d-postgres/04_chinook_ddl.sql https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-postgres/04_chinook_ddl.sql
  wget -O initdb.d-postgres/05_chinook_dml.sql https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-postgres/05_chinook_dml.sql
#+end_src

- What did this do? ::
  This step downloaded PostgreSQL SQL initialization files from this
  GitHub repository, with DDL and DML for the Chinook sample database.

** Step 4:  Scaffold the Docker Compose file.

Use a code editor to start the Docker Compose file with its preamble.

#+begin_src yaml
version: '3.1'
services:
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' > docker-compose.yaml
version: '3.1'
services:
EOF
#+end_src

- What did this do? ::
  This step added the Docker Compose preamble to the
  ~docker-compose.yaml~ file to set the version and create the
  ~services~ node.

** Step 5:  Add the ~postgres~ service.

Use a code editor to add a stanza for the ~postgres~ service.

#+begin_src yaml
  postgres:
    image: postgres:16          # Use a modern version of PostgreSQL.
    environment:                # Set its superuser username and password.
      POSTGRES_PASSWORD: postgres
    volumes:                    # Initialize from the contents of the initialization directory.
      - ./initdb.d-postgres:/docker-entrypoint-initdb.d:ro
    healthcheck:                # Use a sensible healthcheck.
      test: psql -U postgres -d chinook -c "select count(*) from \"Artist\""
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' >> docker-compose.yaml
  postgres:
    image: postgres:16          # Use a modern version of PostgreSQL.
    environment:                # Set its superuser username and password.
      POSTGRES_PASSWORD: postgres
    volumes:                    # Initialize from the contents of the initialization directory.
      - ./initdb.d-postgres:/docker-entrypoint-initdb.d:ro
    healthcheck:                # Use a sensible healthcheck.
      test: psql -U postgres -d chinook -c "select count(*) from \"Artist\""
EOF
#+end_src

- What did this do? ::
  This step adds the ~postgres~ service.  PostgreSQL is used /both/
  as a Hasura data source /and/ as the Hasura metadata database.  In a
  more realistic setting, typically these will be different databases.
  In a tutorial, keeping them in one database is simpler.  The Hasura
  metadata database is largely of incidental importance for this
  tutorial, since its only role is as a channel for synchronizing
  metadata changes across a horizontally-scaled cluster of Hasura
  instances.  With only one instance, that obviously is irrelevant for
  this tutorial.  Nevertheless, the presence of a metadata database is
  a /requirement/ for Hasura v2 even to start.

** Step 7:  Test the PostgreSQL service.

Use Docker Compose to start the ~postgres~ service.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  docker compose up -d postgres
#+end_src

Run a query against the database to verify that it has been
initialized.

#+begin_src bash :eval never-export :exports code :session scratch :results output
  docker exec scratch-postgres-1 psql -U postgres -d chinook -c "select count(*) from \"Artist\""
#+end_src

#+RESULTS:
: count
: -------
:    276
: (1 row)

- What did this do? ::
  This step launched the Docker Compose ~postgres~ service and ran a
  test query just to validate that it has been initialized properly.

** Step 8:  Create a MongoDB initialization directory.

Create a directory to mount into the MongoDB container in order to
initialize the database.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  mkdir -p initdb.d-mongo
#+end_src

- What did this do? ::
  This step creates a directory that will be mounted into the MongoDB
  container as a volume, in a special directory that the container
  image uses to access initialization files.

** Step 9:  Download the MongoDB initialization files.

Download Mongo DB initialization files into its initialization
directory.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  wget -O initdb.d-mongo/01_import_data.sh https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-mongo/01_import_data.sh
  wget -O initdb.d-mongo/postgres.Album.json https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-mongo/postgres.Album.json
  wget -O initdb.d-mongo/postgres.Artist.json https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-mongo/postgres.Artist.json
  wget -O initdb.d-mongo/postgres.Track.json https://raw.githubusercontent.com/hasura/hasura-v2-demo-heterogeneous/main/initdb.d-mongo/postgres.Track.json
#+end_src

- What did this do? ::
  This step downloaded MongoDB initialization scripts and related data
  files from this GitHub repository.

