README.org
** Step 10:  Add the ~mongo~ service.

Use a code editor to add a stanza for the ~mongo~ service.

#+begin_src yaml
  mongo:
    image: mongo:6              # Use a modern version of MongoDB.
    environment:                # Set its superuser username and password.
      MONGO_INITDB_ROOT_PASSWORD: mongo
      MONGO_INITDB_ROOT_USERNAME: mongo
    volumes:                    # Initialize from the contents of the initialization directory.
      - ./initdb.d-mongo:/docker-entrypoint-initdb.d:ro
    depends_on:                 # Wait until postgres starts up first.
      postgres:
        condition: service_healthy
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' >> docker-compose.yaml
  mongo:
    image: mongo:6              # Use a modern version of MongoDB.
    environment:                # Set its superuser username and password.
      MONGO_INITDB_ROOT_PASSWORD: mongo
      MONGO_INITDB_ROOT_USERNAME: mongo
    volumes:                    # Initialize from the contents of the initialization directory.
      - ./initdb.d-mongo:/docker-entrypoint-initdb.d:ro
    depends_on:                 # Wait until postgres starts up first.
      postgres:
        condition: service_healthy
EOF
#+end_src

- What did this do? ::
  This step added a stanza for the ~mongo~ service to the Docker
  Compose file.

** Step 11:  Test the MongoDB service.

User Docker Compose to start the ~mongo~ service.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  docker compose up -d mongo
#+end_src

Run a query against the database to verify that it has been
initialized.

#+begin_src bash :eval never-export :exports code :session scratch :results output
  docker exec scratch-mongo-1 mongosh --quiet -u mongo -p mongo --eval "db.postgres.Album.findOne()" admin
#+end_src

#+RESULTS:
#+begin_example
{"t":{"$date":"2024-07-31T16:11:44.295+00:00"},"s":"I",  "c":"NETWORK",  "id":22943,   "ctx":"listener","msg":"Connection accepted","attr":{"remote":"127.0.0.1:42454","uuid":"7016f115-1f92-4233-86db-6f2590d63450","connectionId":5,"connectionCount":1}}
{"t":{"$date":"2024-07-31T16:11:44.299+00:00"},"s":"I",  "c":"NETWORK",  "id":51800,   "ctx":"conn5","msg":"client metadata","attr":{"remote":"127.0.0.1:42454","client":"conn5","negotiatedCompressors":[],"doc":{"application":{"name":"mongosh 2.2.10"},"driver":{"name":"nodejs|mongosh","version":"6.7.0|2.2.10"},"platform":"Node.js v20.12.2, LE","os":{"name":"linux","architecture":"x64","version":"3.10.0-327.22.2.el7.x86_64","type":"Linux"},"env":{"container":{"runtime":"docker"}}}}}
{"t":{"$date":"2024-07-31T16:11:44.302+00:00"},"s":"I",  "c":"NETWORK",  "id":22943,   "ctx":"listener","msg":"Connection accepted","attr":{"remote":"127.0.0.1:42464","uuid":"848d583f-9ca6-4b7a-a288-31101cfe3f3a","connectionId":6,"connectionCount":2}}
{"t":{"$date":"2024-07-31T16:11:44.303+00:00"},"s":"I",  "c":"NETWORK",  "id":51800,   "ctx":"conn6","msg":"client metadata","attr":{"remote":"127.0.0.1:42464","client":"conn6","negotiatedCompressors":[],"doc":{"application":{"name":"mongosh 2.2.10"},"driver":{"name":"nodejs|mongosh","version":"6.7.0|2.2.10"},"platform":"Node.js v20.12.2, LE","os":{"name":"linux","architecture":"x64","version":"3.10.0-327.22.2.el7.x86_64","type":"Linux"},"env":{"container":{"runtime":"docker"}}}}}
{"t":{"$date":"2024-07-31T16:11:44.308+00:00"},"s":"I",  "c":"ACCESS",   "id":20250,   "ctx":"conn6","msg":"Authentication succeeded","attr":{"mechanism":"SCRAM-SHA-256","speculative":true,"principalName":"mongo","authenticationDatabase":"admin","remote":"127.0.0.1:42464","extraInfo":{}}}
{"t":{"$date":"2024-07-31T16:11:44.348+00:00"},"s":"I",  "c":"NETWORK",  "id":22943,   "ctx":"listener","msg":"Connection accepted","attr":{"remote":"127.0.0.1:42466","uuid":"9aa0c2af-d600-4be6-bef6-48d03bc31985","connectionId":7,"connectionCount":3}}
{"t":{"$date":"2024-07-31T16:11:44.348+00:00"},"s":"I",  "c":"NETWORK",  "id":22943,   "ctx":"listener","msg":"Connection accepted","attr":{"remote":"127.0.0.1:42470","uuid":"ef6cc7b1-ccc4-4a6e-8d07-641d5d742b4b","connectionId":8,"connectionCount":4}}
{"t":{"$date":"2024-07-31T16:11:44.352+00:00"},"s":"I",  "c":"NETWORK",  "id":51800,   "ctx":"conn7","msg":"client metadata","attr":{"remote":"127.0.0.1:42466","client":"conn7","negotiatedCompressors":[],"doc":{"application":{"name":"mongosh 2.2.10"},"driver":{"name":"nodejs|mongosh","version":"6.7.0|2.2.10"},"platform":"Node.js v20.12.2, LE","os":{"name":"linux","architecture":"x64","version":"3.10.0-327.22.2.el7.x86_64","type":"Linux"},"env":{"container":{"runtime":"docker"}}}}}
{"t":{"$date":"2024-07-31T16:11:44.352+00:00"},"s":"I",  "c":"NETWORK",  "id":51800,   "ctx":"conn8","msg":"client metadata","attr":{"remote":"127.0.0.1:42470","client":"conn8","negotiatedCompressors":[],"doc":{"application":{"name":"mongosh 2.2.10"},"driver":{"name":"nodejs|mongosh","version":"6.7.0|2.2.10"},"platform":"Node.js v20.12.2, LE","os":{"name":"linux","architecture":"x64","version":"3.10.0-327.22.2.el7.x86_64","type":"Linux"},"env":{"container":{"runtime":"docker"}}}}}
{"t":{"$date":"2024-07-31T16:11:44.353+00:00"},"s":"I",  "c":"ACCESS",   "id":20250,   "ctx":"conn7","msg":"Authentication succeeded","attr":{"mechanism":"SCRAM-SHA-256","speculative":true,"principalName":"mongo","authenticationDatabase":"admin","remote":"127.0.0.1:42466","extraInfo":{}}}
{"t":{"$date":"2024-07-31T16:11:44.354+00:00"},"s":"I",  "c":"ACCESS",   "id":20250,   "ctx":"conn8","msg":"Authentication succeeded","attr":{"mechanism":"SCRAM-SHA-256","speculative":true,"principalName":"mongo","authenticationDatabase":"admin","remote":"127.0.0.1:42470","extraInfo":{}}}
{
  _id: ObjectId('6637f6cc7cda30b626bb1d07'),
  AlbumId: 1,
  Title: 'For Those About To Rock We Salute You',
  ArtistId: 1
}
{"t":{"$date":"2024-07-31T16:11:44.365+00:00"},"s":"I",  "c":"NETWORK",  "id":22944,   "ctx":"conn8","msg":"Connection ended","attr":{"remote":"127.0.0.1:42470","uuid":"ef6cc7b1-ccc4-4a6e-8d07-641d5d742b4b","connectionId":8,"connectionCount":3}}
{"t":{"$date":"2024-07-31T16:11:44.365+00:00"},"s":"I",  "c":"NETWORK",  "id":22944,   "ctx":"conn6","msg":"Connection ended","attr":{"remote":"127.0.0.1:42464","uuid":"848d583f-9ca6-4b7a-a288-31101cfe3f3a","connectionId":6,"connectionCount":2}}
{"t":{"$date":"2024-07-31T16:11:44.365+00:00"},"s":"I",  "c":"NETWORK",  "id":22944,   "ctx":"conn5","msg":"Connection ended","attr":{"remote":"127.0.0.1:42454","uuid":"7016f115-1f92-4233-86db-6f2590d63450","connectionId":5,"connectionCount":1}}
{"t":{"$date":"2024-07-31T16:11:44.365+00:00"},"s":"I",  "c":"NETWORK",  "id":22944,   "ctx":"conn7","msg":"Connection ended","attr":{"remote":"127.0.0.1:42466","uuid":"9aa0c2af-d600-4be6-bef6-48d03bc31985","connectionId":7,"connectionCount":0}}
#+end_example

- What did this do? ::
  This step used the ~mongosh~ shell to execute a simple query against
  the ~mongo~ service, to check that it has been initialized properly.

** Step 12:  Add the ~mongo_data_connector~ service.

Use a code editor to add a stanza for the ~mongo-data-connector~
service.

#+begin_src yaml
  mongo_data_connector:         # Start the connector agent.
    image: hasura/mongo-data-connector:v2.38.0
    depends_on:                 # Wait until mongo starts up first.
      - mongo
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' >> docker-compose.yaml
  mongo_data_connector:         # Start the connector agent.
    image: hasura/mongo-data-connector:v2.38.0
    depends_on:                 # Wait until mongo starts up first.
      - mongo
EOF
#+end_src

- What did this do? ::
  This step added a MongoDB connector service to the Docker Compose
  file.  Hasura uses an independent connector agent for certain
  databases, such as MongoDB.

** Step 13:  Add the ~redis~ service.

Use a code editor to add a stanza for the ~redis~ service.

#+begin_src yaml
  redis:
    image: redis:latest
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' >> docker-compose.yaml
  redis:
    image: redis:latest
EOF
#+end_src

- What did this do? ::
  This step added a Redis service to the Docker Compose file.  Hasura
  EE uses Redis in two ways.  First, Redis is used for caching.
  Second, Redis is used to store counters and other data that are used
  by Hasura security features like rate-limiting.

