README.org
** Step 14:  Add Hasura.

Use a code editor to add a stanza for the ~hasura~ service.

#+begin_src yaml
  hasura:                       # Start Hasura.
    image: hasura/graphql-engine:v2.40.0
    depends_on:                 # Wait until the connector agent starts up first.
      - mongo_data_connector
    ports:                      # Expose it on a port taken from an environment variable
      - ${HGPORT}:8080
    healthcheck:                # Use a sensible healthcheck.
      test: curl -s http://localhost:8080/healthz
      start_period: 60s
    environment:                # Configure Hasura.
      HASURA_GRAPHQL_ADMIN_SECRET: hasura # Hasura EE requires an admin secret.
      HASURA_GRAPHQL_DEV_MODE: true       # We require dev mode.
      HASURA_GRAPHQL_EE_LICENSE_KEY: ${HASURA_GRAPHQL_EE_LICENSE_KEY} # Hasura EE requires a license key.
      HASURA_GRAPHQL_ENABLE_CONSOLE: true # We require Hasura Console.
      HASURA_GRAPHQL_MAX_CACHE_SIZE: 200  # Set Redis cache size.
      HASURA_GRAPHQL_METADATA_DATABASE_URL: postgres://postgres:postgres@postgres/metadata # Hasura requires a PostgreSQL DB for metadata.
      HASURA_GRAPHQL_METADATA_DEFAULTS: '{"backend_configs":{"dataconnector":{"Mongo":{"uri":"http://mongo_data_connector:3000"}}}}' # Tell Hasura about the connector agent.
      HASURA_GRAPHQL_RATE_LIMIT_REDIS_URL: redis://redis:6379 # Set the Redis URL for rate-limiting.
      HASURA_GRAPHQL_REDIS_URL: redis://redis:6379            # Use the same Redis URL for caching.
#+end_src

Alternatively, add to the file from the command line.

#+begin_src bash :eval never-export :exports code :session scratch :results none
cat <<'EOF' >> docker-compose.yaml
  hasura:                       # Start Hasura.
    image: hasura/graphql-engine:v2.40.0
    depends_on:                 # Wait until the connector agent starts up first.
      - mongo_data_connector
    ports:                      # Expose it on a port taken from an environment variable
      - ${HGPORT}:8080
    healthcheck:                # Use a sensible healthcheck.
      test: curl -s http://localhost:8080/healthz
      start_period: 60s
    environment:                # Configure Hasura.
      HASURA_GRAPHQL_ADMIN_SECRET: hasura # Hasura EE requires an admin secret.
      HASURA_GRAPHQL_DEV_MODE: true       # We require dev mode.
      HASURA_GRAPHQL_EE_LICENSE_KEY: ${HASURA_GRAPHQL_EE_LICENSE_KEY} # Hasura EE requires a license key.
      HASURA_GRAPHQL_ENABLE_CONSOLE: true # We require Hasura Console.
      HASURA_GRAPHQL_MAX_CACHE_SIZE: 200  # Set Redis cache size.
      HASURA_GRAPHQL_METADATA_DATABASE_URL: postgres://postgres:postgres@postgres/metadata # Hasura requires a PostgreSQL DB for metadata.
      HASURA_GRAPHQL_METADATA_DEFAULTS: '{"backend_configs":{"dataconnector":{"Mongo":{"uri":"http://mongo_data_connector:3000"}}}}' # Tell Hasura about the connector agent.
      HASURA_GRAPHQL_RATE_LIMIT_REDIS_URL: redis://redis:6379 # Set the Redis URL for rate-limiting.
      HASURA_GRAPHQL_REDIS_URL: redis://redis:6379            # Use the same Redis URL for caching.
EOF
#+end_src

- What did this do? ::
  This step added a service to the Docker Compose file for ~hasura~.

** Step 15:  Set environment variables.

Set environment variables to be used by Docker Compose but which
should not be hard-coded into the Docker Compose file

#+begin_src bash :eval never-export :exports code :session scratch :results none
  export HASURA_GRAPHQL_EE_LICENSE_KEY=<your EE license key>
  export HGPORT=8081		# or your own port
#+end_src

- What did this do? ::
  This step set the two environment variables that are actually
  necessary.

  - ~HASURA_GRAPHQL_EE_LICENSE_KEY~ :: Because this tutorial uses
    Enterprise features like Redis caching and the MongoDB connector
    agent, we need to use the Hasura EE version with a valid license
    key.
  - ~HGPORT~ :: Because we need to use Hasura Console in Part B of
    this tutorial, we need to access both it and the ~graphql-engine~
    instance within the container.

** Step 16:  Start the ~mongo_data_connector~, ~redis~ and ~hasura~ services.

Use Docker Compose to start the ~mongo_data_connector~, ~redis~ and
~hasura~ services.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  docker compose up -d mongo_data_connector redis hasura
#+end_src

- What did this do? ::
  This step

** Step 17:  Open the Hasura Console and log in.

Open a browser to the Hasura Console.

#+begin_src bash :eval never-export :exports code :session scratch :results none
  xdg-open http://localhost:8081	# or your own port
#+end_src

- What did this do? ::
  This step just launched a web browser to the running instance of
  graphql-engine, which will cause the Hasura Console interface to
  appear.

* Part B:  In Hasura Console

** Step 1:  Add the postgres database and track its tables.

Use Hasura Console as illustrated here to add the ~postgres~ database
and track its tables. 

The database url is: ~postgres://postgres:postgres@postgres/chinook~.

Use Hasura Console as illustrated here to track /some/ of the
~postgres~ tables:

- Genre
- MediaType
- Playlist
- PlaylistTrack
- Customer
- Invoice
- InvoiceLine

Do not track these tables:

- Artist
- Album
- Track

The reason not to track these tables in the ~postgres~ database is
that these data will instead be brought in from the ~mongo~ database.

[[https://github.com/user-attachments/assets/77424ec0-e1ed-4241-92e8-7ed3ea5ba261][2024-07-31_10-53-36.webm]]

- What did this do? ::
  This step used Hasura Console to edit the Hasura metadata in order
  to add the ~postgres~ database (itself a Docker Compose service) as
  a data source.  It also "tracked" these tables, which means to add
  them to the GraphQL API.

** Step 2:  Add the mongo database and track the mongo collections

Use Hasura Console as illustrated here to add the ~mongo~ database.

The database url is:  ~mongodb://mongo:mongo@mongo:27017~

The database is:  ~admin~

Use Hasura Console as illustrated here to track the ~mongo~
collections.

Note that because MongoDB is a document database and can hold data
without a schema, an extra step is involved to choose the type for the
GraphQL schema.  A sample document from the MongoDB collection is
taken and used to generate corresponding Hasura Logical Models.  To do
this, run these commands and copy the output into Hasura Console when
track the collections.

#+begin_src bash :eval never-export :exports both :session scratch :results output
docker exec scratch-mongo-1 mongosh --quiet -u mongo -p mongo --eval "EJSON.stringify(db.postgres.Artist.findOne())" admin
docker exec scratch-mongo-1 mongosh --quiet -u mongo -p mongo --eval "EJSON.stringify(db.postgres.Album.findOne())" admin
docker exec scratch-mongo-1 mongosh --quiet -u mongo -p mongo --eval "EJSON.stringify(db.postgres.Track.findOne())" admin
#+end_src

[[https://github.com/user-attachments/assets/9b2c7c46-d7e3-41ef-aa81-c39f77feaabc][2024-07-31_11-23-07.webm]]

- What did this do? ::
  This step used Hasura Console to edit the Hasura metadata in order to
  add the ~mongo~ database (also a Docker Compose service) as a data
  source. As discussed above, it also sampled the mongo collections in
  order to track its collections with suitable Logical Models.

