README.org
** Step 3:  Try a sample query.

Use Hasura Console as illustrated here to try a sample GraphQL query
that traverses both data source, ~postgres~ and ~mongo~, via the
relationships that were established earlier.

#+begin_src graphql
query MyQuery {
  Artist(limit: 1) {
    Name
    albums(limit: 1) {
      Title
      tracks(limit: 1) {
        Name
        genre {
          Name
        }
        mediatype {
          Name
        }
        playlisttracks {
          PlaylistId
          Playlist {
            Name
          }
        }
      }
    }
  }
}
#+end_src

[[https://github.com/user-attachments/assets/fcb542bf-1338-49a0-b6c2-41f7674d458b][2024-07-31_11-58-04.webm]]

- What did this do? ::
  This used the API tab in Hasura Console, itself a GraphQL client, to
  access the GraphQL endpoint, and issue a sample query.

#  LocalWords:  throughs rf EOF healthcheck mongosh ctx msg attr uuid
#  LocalWords:  connectionId connectionCount conn js os linux runtime
#  LocalWords:  negotiatedCompressors cfe SHA principalName extraInfo
#  LocalWords:  authenticationDatabase aa af bef bc ef ccc ObjectId
#  LocalWords:  cda bb redis EE HGPORT backend configs dataconnector
#  LocalWords:  uri xdg webm EJSON MyQuery mediatype playlisttracks
#  LocalWords:  PlaylistId
